In [1]:
import pandas as pd

# Parameters

In [2]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon', 'Parrot', 'Parrot'],
    'Max Speed': [380., 370., 24., 26.]})
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

## by= column

In [15]:
df.groupby(by=['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [7]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild']]
arrays

[['Falcon', 'Falcon', 'Parrot', 'Parrot'],
 ['Captive', 'Wild', 'Captive', 'Wild']]

## level=

In [9]:
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
df = pd.DataFrame({'Max Speed': [380., 370., 24., 26.]}, index=index)
df

                Max Speed
Animal Type
Falcon Captive      380.0
       Wild         370.0
Parrot Captive       24.0
       Wild          26.0

In [12]:
df.groupby(level='Animal').mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [14]:
df.groupby(level='Type').mean()

         Max Speed
Type
Captive      202.0
Wild         198.0

## dropna=False

In [18]:
l = [[1, 2, 3], 
     [1, None, 4], 
     [2, 1, 3], 
     [1, 2, 2]]
l

[[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]

In [19]:
df = pd.DataFrame(l, columns=["a", "b", "c"])
df

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [32]:
df.groupby("b", dropna=False).sum()

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

In [34]:
l = [["a", 12, 12], [None, 12.3, 33.], ["b", 12.3, 123], ["a", 1, 1]]
df = pd.DataFrame(l, columns=["a", "b", "c"])
df

      a     b      c
0     a  12.0   12.0
1  None  12.3   33.0
2     b  12.3  123.0
3     a   1.0    1.0

In [35]:
df.groupby("a", dropna=False).sum()

        b      c
a
a    13.0   13.0
b    12.3  123.0
NaN  12.3   33.0

## group_keys=

In [36]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})
df.groupby("Animal", group_keys=True)[['Max Speed']].apply(lambda x: x)

          Max Speed
Animal
Falcon 0      380.0
       1      370.0
Parrot 2       24.0
       3       26.0

In [37]:
df.groupby("Animal", group_keys=False)[['Max Speed']].apply(lambda x: x)

   Max Speed
0      380.0
1      370.0
2       24.0
3       26.0